# Создание файла example2.txt и заполнение его 10 строками текста
echo "Это строка номер 1" >> example2.txt
echo "Это строка номер 2" >> example2.txt
echo "Это строка номер 3" >> example2.txt
echo "Это строка номер 4" >> example2.txt
echo "Это строка номер 5" >> example2.txt
echo "Это строка номер 6" >> example2.txt
echo "Это строка номер 7" >> example2.txt
echo "Это строка номер 8" >> example2.txt
echo "Это строка номер 9" >> example2.txt
echo "Это строка номер 10" >> example2.txt

# Открытие файла с помощью less
less example2.txt

# В less:
# - Нажмите '?' для перехода на следующую страницу.
# - Нажмите '?' для возврата на предыдущую страницу.
# - Нажмите '?' для выхода из программы.